01_intro_to_rails/flatrion-theater/app/controllers/productions_controller.rb

SELECT "productions".* FROM "productions"
---
    def index
        render json: Production.all, except:[:created_at, :updated_at], status: :ok

SELECT "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        byebug
        production = Production.find(params[:id])